cask_args appdir: '/Applications'

brew "git"
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed
brew "dnsmasq", restart_service: :changed
brew "nodenv"
brew "rbenv"
brew "packer"
brew "terraform"
brew "vault"

# Useful system stuff
brew "bash"
brew "binutils"
brew "coreutils"
brew "docker-machine-driver-xhyve"
brew "findutils", args: ['with-default-names']
brew "fzf"
brew "gawk"
brew "gnu-indent", args: ['with-default-names']
brew "gnu-sed", args: ['with-default-names']
brew "gnu-tar", args: ['with-default-names']
brew "gnu-which", args: ['with-default-names']
brew "gnutls"
brew "gpg"
brew "gpg-agent"
brew "grc"
brew "htop"
brew "httpie"
brew "hub"
brew "moreutils"
brew "pinentry-mac"
brew "ssh-copy-id"
brew "tree"
brew "watch"
brew "wdiff", args: ['with-gettext']
brew "wget"
brew "yubikey-personalization"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "alfred"
cask "arq"
cask "aws-vault"
cask "caffeine"
cask "dash"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "flux"
cask "google-chrome"
cask "gpgtools"
cask "gyazo"
cask "hazel"
cask "imagealpha"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "keybase"
cask "licecap"
cask "licecap"
cask "noizio"
cask "paste"
cask "rescuetime"
cask "slack"
cask "spectacle"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"
cask "vlc"
cask "vmware-fusion"
cask "yubikey-personalization-gui"
