cask_args appdir: '/Applications'

tap "caskroom/fonts"
tap "caskroom/versions"

brew "git"
brew "dnsmasq", restart_service: :changed
brew "nodenv"
brew "rbenv"
brew "packer"
brew "terraform"
brew "vault"

# Useful system stuff
brew "bash"
brew "binutils"
brew "coreutils"
brew "findutils", args: ['with-default-names']
brew "fzf"
brew "gawk"
brew "gnu-indent", args: ['with-default-names”']
brew "gnu-sed", args: ['with-default-names']
brew "gnu-tar", args: ['with-default-names']
brew "gnu-which", args: ['with-default-names']
brew "gnutls"
brew "gpg-agent"
brew "gpg2"
brew "graphviz"
brew "grc"
brew "htop"
brew "httpie"
brew "hub"
brew "jq"
brew "exa"
brew "kubectx"
brew "mas"
brew "memcached"
brew "moreutils"
brew "openssl"
brew "phantomjs"
brew "pinentry-mac"
brew "roundup"
brew "ssh-copy-id"
brew "tree"
brew "watch"
brew "wdiff", args: ['with-gettext']
brew "wget"
brew "yarn"
brew "yubikey-personalization"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "alfred"
cask "arq"
cask "aws-vault"
cask "dash"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "flux"
cask "google-chrome"
cask "google-chrome-canary"
cask "gpgtools"
cask "hazel"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keybase"
cask "licecap"
cask "paste"
cask "postico"
cask "sketch"
cask "slack"
cask "spectacle"
cask "sublime-text"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"
cask "vlc"
cask "vmware-fusion"

# AppStore stuff
mas "tweetbot", id: 557168941

# Fonts
cask "font-source-code-pro"
cask "font-robotomono"
cask "font-robotomono-nerd-font-mono"
