cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Useful system stuff
# brew "findutils", args: ['with-default-names']
# brew "gnu-indent", args: ['with-default-names']
# brew "gnu-sed", args: ['with-default-names']
# brew "gnu-tar", args: ['with-default-names']
# brew "gnu-which", args: ['with-default-names']
# brew "wdiff", args: ['with-gettext']
brew "asdf"
brew "autoconf"
brew "automake"
brew "bash"
brew "binutils"
brew "coreutils"
brew "coreutils"
brew "curl"
brew "dnsmasq", restart_service: :changed
brew "exa"
brew "fzf"
brew "gawk"
brew "git"
brew "gnutls"
brew "graphviz"
brew "grc"
brew "htop"
brew "httpie"
brew "hub"
brew "jq"
brew "zlib"
brew "kubectx"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "mas"
brew "memcached"
brew "moreutils"
brew "nodenv"
brew "openssl"
brew "packer"
brew "pinentry-mac"
brew "rbenv"
brew "readline"
brew "roundup"
brew "ssh-copy-id"
brew "terraform"
brew "tree"
brew "unixodbc"
brew "unzip"
brew "vault"
brew "watch"
brew "wdiff"
brew "wget"
brew "yarn"
brew "wxmac"
brew "fop"
cask "java"
brew "yubikey-personalization"

# ZSH Stuff
brew "zsh"
brew "zplug"

# GPG Stuff
brew "gpg2"
cask "gpg-suite"

# Browsers
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "microsoft-edge"
cask "microsoft-edge-dev"

# Useful apps
cask "alfred"
cask "aws-vault"
cask "dash"
cask "docker"
cask "fantastical"
# cask "gpgtools"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "licecap"
cask "postico"
cask "sketch"
cask "sublime-text"
cask "visual-studio-code"
cask "vagrant"
cask "viscosity"
cask "vlc"
cask "vmware-fusion"

# Fonts
cask "font-hack"
cask "font-source-code-pro"
cask "font-roboto-mono"
cask "font-robotomono-nerd-font-mono"
